In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'2.2.2'

In [ ]:
# pd.read_csv

## p.110- PANDAS 객체

#### pandas객체 1 - Series 객체 (column)

In [3]:
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [13]:
type(data.values), data.values
# pandas도 numpy베이스

(numpy.ndarray, array([0.25, 0.5 , 0.75, 1.  ]))

In [5]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
data[1:3]

1    0.50
2    0.75
dtype: float64

In [8]:
data = pd.Series([0.25,0.5,0.75,1.0], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
data['b']

0.5

In [10]:
# 파이썬 딕셔너리에서 직접 Series객체 구성가능
population_dict = {'California':38332521, 'Texas':26448193, 'New York':19651127}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
dtype: int64

In [21]:
population['California':'New York']
# 문자인 키값으로도 슬라이싱 가능

California    38332521
Texas         26448193
New York      19651127
dtype: int64

In [17]:
data0 = pd.Series({2:'a',3:'b',1:'c'}, index=[3,2])
data0

3    b
2    a
dtype: object

In [18]:
data0.index

Index([3, 2], dtype='int64')

In [19]:
data0[2], type(data0)

('a', pandas.core.series.Series)

#### pandas객체 2 - DataFrame 객체 (excel)

In [22]:
area_dict = {'California':423967, 'Texas':695662, 'New York':141297}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
dtype: int64

In [24]:
states = pd.DataFrame({'population':population,'area':area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297

In [25]:
states.index

Index(['California', 'Texas', 'New York'], dtype='object')

In [27]:
states.columns

Index(['population', 'area'], dtype='object')

In [28]:
states['area']

California    423967
Texas         695662
New York      141297
Name: area, dtype: int64

In [31]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127

In [32]:
# 딕셔너리의 리스트를 DataFrame으로 만들 수 O
data = [{'a':1,'b':2*i} for i in range(3)]
pd.DataFrame(data)

   a  b
0  1  0
1  1  2
2  1  4

In [33]:
pd.DataFrame([{'a':1,'b':2},{'b':3,'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [36]:
# Series 객체의 딕셔너리로 구성될 수도 O
df = pd.DataFrame({'population':population, 'area':area})
df.head(), df.columns

(            population    area
 California    38332521  423967
 Texas         26448193  695662
 New York      19651127  141297,
 Index(['population', 'area'], dtype='object'))

In [35]:
pd.DataFrame(np.random.rand(3,2),
             columns=['foo','bar'],
             index=['a','b','c'])

        foo       bar
a  0.484320  0.345507
b  0.908815  0.956522
c  0.751021  0.893901

In [37]:
A = np.zeros(3,dtype=[('A','i8'),('B','f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [38]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [39]:
# ! 데이터분석 시작할 때 <head, info, describe> 하고 시작 !
df = pd.read_csv('python-ds-handbook/notebooks/data/president_heights.csv')
df.head() # 가장 위의 5개 읽어오기 (데이터수 입력가능)

   order               name  height(cm)
0      1  George Washington         189
1      2         John Adams         170
2      3   Thomas Jefferson         189
3      4      James Madison         163
4      5       James Monroe         183

In [40]:
np.average(df['height(cm)'])

179.73809523809524

In [41]:
df.info() # null값이 있는지 쉽게 파악가능

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order       42 non-null     int64
 1   name        42 non-null     object
 2   height(cm)  42 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.1+ KB

In [42]:
df.describe() # std : 표준편차

           order  height(cm)
count  42.000000   42.000000
mean   22.476190  179.738095
std    13.152461    7.015869
min     1.000000  163.000000
25%    11.250000  174.250000
50%    22.000000  182.000000
75%    33.750000  183.000000
max    44.000000  193.000000

#### pandas객체 3 - Index 객체 (불변의 배열)

In [43]:
ind = pd.Index([2,3,5,7,11])
ind

Index([2, 3, 5, 7, 11], dtype='int64')

In [44]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [45]:
ind[1] = 0 # 일반적인 방법으로 변경불가 --> err

TypeError: Index does not support mutable operations

In [46]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [ ]:
# &,|,^ 지원X

In [56]:
indA&indB, indA.intersection(indB) # 교집합

(Index([0, 3, 5, 7, 9], dtype='int64'), Index([3, 5, 7], dtype='int64'))

In [58]:
indA|indB, indA.union(indB) # 합집합

(Index([3, 3, 5, 7, 11], dtype='int64'),
 Index([1, 2, 3, 5, 7, 9, 11], dtype='int64'))

In [60]:
indA^indB, indA.symmetric_difference(indB) # 대칭차(두 집합의 상대 여집합의 합)

(Index([3, 0, 0, 0, 2], dtype='int64'), Index([1, 2, 9, 11], dtype='int64'))

## p.121- 데이터 인덱싱과 선택

In [61]:
data = pd.Series([0.25,0.5,0.75,1.0], index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [62]:
'a' in data

True

In [64]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [65]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [66]:
data[(data>0.3)&(data<0.8)] # 마스킹

b    0.50
c    0.75
dtype: float64

In [67]:
data[['a','e']] # 펜시인덱싱

a    0.25
e    1.25
dtype: float64

In [68]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [69]:
data[0:2] # 명시적인덱스로 슬라이싱하면 끝도 포함O / 암묵적인덱스로 슬리이싱하면 포함X

a    0.25
b    0.50
dtype: float64

#### ! loc, iloc 인덱서 ! -- 많이 사용

In [71]:
data = pd.Series(['a','b','c'],index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [73]:
data[3] # 명시적인덱스 사용

'b'

In [74]:
data[1:3] # 암묵적인덱스 사용

3    b
5    c
dtype: object

In [75]:
df = pd.read_csv('python-ds-handbook/notebooks/data/president_heights.csv')

In [76]:
df.loc[40,'name':'heitht(cm)'] # 명시적인덱스

name    George W. Bush
Name: 40, dtype: object

In [77]:
df.iloc[40,1:2] # 암묵적인덱스

name    George W. Bush
Name: 40, dtype: object

In [ ]:
# 이렇게 링크로 데이터 가져올 수도 있음
titanic_df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

#### p.124- DataFrame에서 데이터 선택

In [78]:
pop_dict = {'Cal': 38000000,
            'Tex': 2640000,
            'NY': 1960000,
            'Flo': 1950000,
            'Ill': 1280000}
pop = pd.Series(pop_dict)

area_dict = {'Cal': 420000,
            'Tex': 690000,
            'NY': 141000,
            'Flo': 170000,
            'Ill': 149000}
area = pd.Series(area_dict)

df = pd.DataFrame({'pop' : pop, 'area': area})

In [79]:
df.head(), df.columns, len(df)

(          pop    area
 Cal  38000000  420000
 Tex   2640000  690000
 NY    1960000  141000
 Flo   1950000  170000
 Ill   1280000  149000,
 Index(['pop', 'area'], dtype='object'),
 5)

In [82]:
df['area']

Cal    420000
Tex    690000
NY     141000
Flo    170000
Ill    149000
Name: area, dtype: int64

In [83]:
df.area # 둘 다 가능하지만, 열이름이 문자열이거나 메서드와 겹치는 이름이면 df.pop이 아니라 df['pop'] 이런식으로 접근

Cal    420000
Tex    690000
NY     141000
Flo    170000
Ill    149000
Name: area, dtype: int64

In [85]:
df['density'] = df['pop']/df['area'] # 새로운 column 만들기
df

          pop    area    density
Cal  38000000  420000  90.476190
Tex   2640000  690000   3.826087
NY    1960000  141000  13.900709
Flo   1950000  170000  11.470588
Ill   1280000  149000   8.590604

In [86]:
df.values

array([[3.80000000e+07, 4.20000000e+05, 9.04761905e+01],
       [2.64000000e+06, 6.90000000e+05, 3.82608696e+00],
       [1.96000000e+06, 1.41000000e+05, 1.39007092e+01],
       [1.95000000e+06, 1.70000000e+05, 1.14705882e+01],
       [1.28000000e+06, 1.49000000e+05, 8.59060403e+00]])

In [95]:
df.values[1:,2:] # 넘파이 슬라이싱

array([[ 3.82608696],
       [13.90070922],
       [11.47058824],
       [ 8.59060403]])

In [87]:
df.T # 행과 열을 서로 바꿈

                  Cal           Tex            NY           Flo           Ill
pop      3.800000e+07  2.640000e+06  1.960000e+06  1.950000e+06  1.280000e+06
area     4.200000e+05  6.900000e+05  1.410000e+05  1.700000e+05  1.490000e+05
density  9.047619e+01  3.826087e+00  1.390071e+01  1.147059e+01  8.590604e+00

In [88]:
df.iloc[:3,:2] # 슬라이싱 이후에도 DataFrame (df.values[1:,2:] # 넘파이 슬라이싱과의 차이점)

          pop    area
Cal  38000000  420000
Tex   2640000  690000
NY    1960000  141000

In [91]:
df.loc[:'Flo',:'area']

          pop    area
Cal  38000000  420000
Tex   2640000  690000
NY    1960000  141000
Flo   1950000  170000

In [94]:
df.loc[df.density>50,['pop','density']]

          pop   density
Cal  38000000  90.47619

In [96]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [99]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                  columns=['A','B','C','D'])
df

   A  B  C  D
0  6  3  8  2
1  4  2  6  4
2  8  6  1  3

In [100]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [101]:
np.sin(df*np.pi/4)

              A         B             C             D
0 -1.000000e+00  0.707107 -2.449294e-16  1.000000e+00
1  1.224647e-16  1.000000 -1.000000e+00  1.224647e-16
2 -2.449294e-16 -1.000000  7.071068e-01  7.071068e-01

In [102]:
pop/area

Cal    90.476190
Tex     3.826087
NY     13.900709
Flo    11.470588
Ill     8.590604
dtype: float64

#### Series에서 인덱스 정렬

In [105]:
# ! INDEX를 따라 연산함 !
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A+B # 인덱스가 한쪽에 없으면 null값 처리

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [106]:
A.add(B)

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [107]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [108]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                  columns=['A','B','C','D'])
df2 = pd.DataFrame(rng.randint(0,10,(3,3)),
                  columns=['B','C','A'])

In [109]:
df+df2

    A   B   C   D
0  15   4  10 NaN
1  14   7   2 NaN
2   9  12  11 NaN

## p.137- 누락된 데이터 처리하기

In [110]:
vals1 = np.array([1,None,2,3])
vals1

array([1, None, 2, 3], dtype=object)

In [111]:
%timeit np.arange(1E6,dtype=int).sum()

1.19 ms ± 28.1 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [112]:
%timeit np.arange(1E6,dtype=object).sum()

36.1 ms ± 1.02 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [113]:
vals1.sum() # None에 대한 연산 불가 --> err

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [114]:
vals2 = np.array([1,np.nan,3,4])
vals2.dtype

dtype('float64')

In [115]:
1+np.nan

nan

In [117]:
0*np.nan

nan

In [118]:
vals2.sum(), vals2.min(), vals2.max() # nan이 포함되면 모두 nan이 되어버림

(nan, nan, nan)

In [119]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2) # 누락된 값을 무시하는 집계연산 (nan에 안전)

(8.0, 1.0, 4.0)

In [120]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [122]:
x = pd.Series(range(2),dtype=int)
x

0    0
1    1
dtype: int32

In [124]:
x[0] = None # None은 부동소수점값이라서 None을 담을 수 있도록 소수점타입으로 변경됨
x

0    NaN
1    1.0
dtype: float64

In [126]:
pd.Series([1,np.nan, 2, None, pd.NA], dtype="Int32")

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [128]:
data = pd.Series([1,np.nan,'hello',None])

In [129]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [130]:
data[data.notnull()]

0        1
2    hello
dtype: object

#### 널값 제거하기

In [131]:
data.dropna() # 함부로 안씀

0        1
2    hello
dtype: object

In [134]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [135]:
df.dropna() # 널값이 있는 모든 행을 삭제

     0    1  2
1  2.0  3.0  5

In [137]:
df.dropna(axis="columns") # 널값이 있는 모든 열을 삭제

   2
0  2
1  5
2  6

In [138]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [139]:
df.dropna(axis="columns",how="all") # 모두 널값인 행, 열만 삭제하도록 how 설정

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [142]:
df.dropna(axis="rows", thresh=3)
# thresh매개변수(N이면) 해당 행 또는 열에 Null이 아닌 N개 이상의 값이 있는 경우 삭제하면 안됨

     0    1  2   3
1  2.0  3.0  5 NaN

#### 널값 채우기

In [143]:
data = pd.Series([1,np.nan,2,None,3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [144]:
# 0으로 채우기
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [147]:
# 이전값으로 채우기 (첫번째 값이 널값이면 안채워짐)
data.ffill()

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [148]:
# 다음값으로 채우기 
data.bfill()

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [149]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [150]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [153]:
titanic_df2 = titanic_df.ffill()

In [154]:
titanic_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        890 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [158]:
avg_age = np.nanmean(titanic_df.Age.values)
titanic_df3 = titanic_df['Age'].fillna(avg_age)
titanic_df3.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB